tutorials/heatSourceCalibration/template/constant/heatSourceDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      heatSourceDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sources
{
    beam
    {
        path            scanPath;
        widthReference  D4Sigma;
        D4Sigma         <<D4Sigma>>;
        depthReference  isotherm;
        isotherm        <<isotherm>>;

        absorption
        {
            model               Kelly;
            eta0                0.27;
            etaMin              0.27;
            aspectRatioSwitch   0.0;
            geometry            cylinder;
        }

        heatSource
        {
            model               projected;
            depth               20.0e-6;
            nPoints             (10 10 10);

            profile
            {
                model   tabulated;
                file    "beam_profile.txt";
            }

            projection
            {
                model       exponential;
                nSlope      0.0;
                nIntercept  <<nIntercept>>;
            }
        }
    }
}

refinement
{
    model                   none;

    refinementTemperature   1000;

    buffers
    {
        beam                (100.0e-6 100.0e-6 600e-6);
    }

    targetCellsPerProc      5000;
    nBufferVolumes          4;
    maxSearchIter           10;
    timeTolerance           1e-4;
}

// ************************************************************************* //
